results/redis-cache.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * default: 50 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 4812 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  01.0s/10s

running (02.0s), 50/50 VUs, 9056 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  02.0s/10s

running (03.0s), 50/50 VUs, 13404 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  03.0s/10s

running (04.0s), 50/50 VUs, 18404 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  04.0s/10s

running (05.0s), 50/50 VUs, 23454 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  05.0s/10s

running (06.0s), 50/50 VUs, 26311 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  06.0s/10s

running (07.0s), 50/50 VUs, 28717 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  07.0s/10s

running (08.0s), 50/50 VUs, 31198 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  08.0s/10s

running (09.0s), 50/50 VUs, 33633 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  09.0s/10s

running (10.0s), 50/50 VUs, 36039 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  10.0s/10s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=13.82ms min=2.07ms med=11.44ms max=39.59ms p(90)=21.19ms p(95)=22.33ms
      { expected_response:true }...: avg=13.82ms min=2.07ms med=11.44ms max=39.59ms p(90)=21.19ms p(95)=22.33ms
    http_req_failed................: 0.00%  0 out of 36100
    http_reqs......................: 36100  3603.693356/s

    EXECUTION
    iteration_duration.............: avg=13.85ms min=2.07ms med=11.47ms max=43.76ms p(90)=21.21ms p(95)=22.37ms
    iterations.....................: 36100  3603.693356/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 235 MB 23 MB/s
    data_sent......................: 3.0 MB 296 kB/s



running (10.0s), 00/50 VUs, 36100 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  10s